app/Controllers/AdminPagesData.php

SELECT *
FROM `admin_pages_data`
ORDER BY `id` DESC
---
    public function index()
    {
        helper(['form', 'url']);
        $model = new AdminPagesDataModel();

        $data['admin_pages_data_detail'] = $model->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `admin_pages_data`
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `admin_pages_data`
WHERE `id` = 11
 LIMIT 1
---
    public function store()
    {
        helper(['form', 'url']);
        $model = new AdminPagesDataModel();
        $data['admin_pages_data_detail'] = $model->orderBy('id','DESC')->first();
        foreach($data as $row){
            if (isset($row['id'])){
                $nextId=intval($row['id']+1);
            }
            else
            {
                $nextId=1;
            }
        }

        $formatted_text = str_replace(['<p>', '</p>'], '', $this->request->getVar('admin_page_component_data'));
        $data = [
            'id' => $nextId,
            'admin_page_id' => $this->request->getVar('admin_page_id'),
            'admin_page_name'  => $this->request->getVar('admin_page_name'),
            'admin_page_component_data_no'  => $this->request->getVar('admin_page_component_data_no'),
            'admin_page_component_name'  => $this->request->getVar('admin_page_component_name'),
            'admin_page_component_data' => $formatted_text,
            ];
        $save = $model->insert_data($data);
        if($save != false)
        {
            $data = $model->where('id', $save)->first();

SELECT *
FROM `admin_pages_data`
WHERE `id` = '1'
 LIMIT 1
---
    public function edit($id=null)
    {

     $model = new AdminPagesDataModel();

     $data = $model->where('id',$id )->first();

SELECT *
FROM `admin_pages_data`
WHERE `id` = '5'
 LIMIT 1
---
    public function update()
    {

        helper(['form', 'url']);

        $model = new AdminPagesDataModel();

        $id = $this->request->getVar('id');
        $formatted_text = str_replace(['<p>', '</p>'], '', $this->request->getVar('admin_page_component_data'));
        $data = [
            'admin_page_id' => $this->request->getVar('admin_page_id'),
            'admin_page_component_id'  => $this->request->getVar('admin_page_component_id'),
            'admin_page_component_data_no'  => $this->request->getVar('admin_page_component_data_no'),
            'admin_page_component_name'  => $this->request->getVar('admin_page_component_name'),
            'admin_page_component_data'  => $formatted_text,
            ];

        $update = $model->update($id,$data);
        if($update != false)
        {
            $data = $model->where('id', $id)->first();