app/Controllers/AdminPagesGrandMaster.php

    public function index()
    {
        $model = new AdminPagesGrandMasterModel();
        $data['admin_pages_grand_master_detail'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `admin_pages_grand_master`
ORDER BY `admin_page_id` DESC

    public function store()
    {
        helper(['form', 'url']);

        $model = new AdminPagesGrandMasterModel();
        $data['admin_pages_grand_master_detail'] = $model->orderBy('id', 'DESC')->first();

        foreach($data as $row){
            if (isset($row['id'])){
                $nextPageId=intval($row['id']+1);
            }
            else
            {
                $nextPageId=1;
            }
        }
    $data = [
            'id' => $nextPageId,
            'admin_page_id'=> $this->request->getVar('admin_page_id'),
            'admin_page_name'  => $this->request->getVar('admin_page_name'),
            'admin_view_path_page'  => $this->request->getVar('admin_view_path_page'),
            ];
            $save = $model->insert_data($data);
        if($save != false)
        {
            $data = $model->where('id', $save)->first();
---
SELECT *
FROM `admin_pages_grand_master`
ORDER BY `admin_page_id` DESC
 LIMIT 1
SELECT *
FROM `admin_pages_grand_master`
WHERE `admin_page_id` = '456456467'
 LIMIT 1

    public function update()
    {

        helper(['form', 'url']);

        $model = new AdminPagesGrandMasterModel();

        $id = $this->request->getVar('id');

        $data = [
            'admin_page_id' => $this->request->getVar('admin_page_id'),
            'admin_page_name'  => $this->request->getVar('admin_page_name'),
            'admin_view_path_page'  => $this->request->getVar('admin_view_path_page'),
            ];

        $update = $model->update($id,$data);
        if($update != false)
        {
            $data = $model->where('id', $id)->first();
---
SELECT *
FROM `admin_pages_grand_master`
WHERE `id` IS NULL
 LIMIT 1