app/Controllers/AdminPagesMaster.php

    public function index()
    {   helper(['form', 'url']);


        $model = new AdminPagesMasterModel();
        $data['admin_pages_master_detail'] = $model->orderBy('admin_page_id', 'DESC')->findAll();
---
SELECT *
FROM `admin_pages_master`
ORDER BY `admin_page_id` DESC