app/Controllers/Blog.php

    public function store()
 {

        helper( [ 'form', 'url' ] );
        $model = new BlogDataModel();
        $data[ 'blog_details' ] = $model->orderBy( 'blog_id', 'DESC' )->first();
---
SELECT *
FROM `blog_details`
ORDER BY `blog_id` DESC

    public function showAll()
 {
        $responseArray=[];
        helper( [ 'form', 'url' ] );
        $model = new BlogDataModel();
     //   $data[ 'blog_details' ] = $model->orderBy( 'blog_id', 'DESC' )->findAll();
       $data['blog_details']=$model->paginate();
---
SELECT *
FROM `blog_details`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `blog_details`

    public function blogCategory($acceptBlogCategory=null)
    {
        $model = new BlogDataModel();
        $data['blog_details']=$model->getBlogCategory("'".$acceptBlogCategory."'");
        $data['organizecategory']=$model->organizeCategory();
        $model->paginate();
---
SELECT *
FROM `blog_details`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `blog_details`