app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `user_email` = 'rajeshwari@gmail.com'
 LIMIT 1
---
    public function auth($directHome)
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $model->where('user_email', $email)->first();