app/Models/AdminPagesGrandMasterModel.php

INSERT INTO `admin_pages_grand_master` (`admin_page_id`, `admin_page_name`, `admin_view_path_page`) VALUES (456456468, 'asdasdasd', 'asASasaS')
---
    public function insert_data($data) {
        if($this->db->table($this->table)->insert($data))