app/Models/AdminPagesDataModel.php

INSERT INTO `admin_pages_data` (`id`, `admin_page_id`, `admin_page_name`, `admin_page_component_data_no`, `admin_page_component_name`, `admin_page_component_data`) VALUES (11, '2', 'My Second Page', '4', 'Component 4 Second Page', '<h2>Component 4 Second Page <span style=\"font-family: verdana, geneva, sans-serif; background-color: rgb(186, 55, 42);\">Data</span></h2>')
---
    public function insert_data($data) {
        if($this->db->table($this->table)->insert($data))